/*
 * Добавление нового животного
    	- Реализовать функциональность для добавления новых животных в реестр.      
 Животное должно определяться в правильный класс (например, "собака", 
 "кошка", "хомяк" и т.д.)

  Список команд животного
    	- Вывести список команд, 
        которые может выполнять добавленное животное (например, "сидеть", "лежать").

*/
package service;

public class AnimalService {

    public void actions(char option){
        if
    }

    public int getAnimalCount(List<>){

    }



    
}
